[
    {
      "id": 1,
      "title": "Spaghetti Carbonara",
      "summary": "A classic Italian pasta dish with eggs, cheese, bacon, and black pepper.",
      "image": "https://via.placeholder.com/150",
      "ingredients": [ "400g spaghetti", "150g pancetta or guanciale (cut into small cubes)","3 large eggs","1 cup grated Pecorino Romano cheese (or Parmesan)", "Freshly ground black pepper", "Salt (for pasta water)","2 cloves garlic (optional)", "Olive oil (optional)"],
      "instructions": ["Bring a large pot of salted water to a boil and cook the spaghetti according to package instructions until al dente. Reserve about 1 cup of pasta water before draining.",
    "In a large skillet, cook the pancetta or guanciale over medium heat until crispy (about 5-7 minutes). You can add a little olive oil if needed, but traditionally no extra oil is used. Optionally, you can sauté garlic in the fat for extra flavor.",
"While the pancetta is cooking, whisk together the eggs and grated Pecorino Romano (or Parmesan) in a bowl. Season with a generous amount of freshly ground black pepper.",
"Once the spaghetti is cooked and drained, add it to the skillet with the pancetta, tossing to coat in the rendered fat. Remove the skillet from the heat.",
"Pour the egg and cheese mixture over the hot pasta, tossing quickly to coat the spaghetti. The heat from the pasta will gently cook the eggs, creating a creamy sauce. If the sauce is too thick, add a little reserved pasta water to loosen it.",
"Plate the spaghetti carbonara and top with extra Pecorino Romano, more freshly ground black pepper, and a sprinkle of pancetta if desired."]
    },
    {
      "id": 2,
      "title": "Chicken Tikka Masala",
      "summary": "Chunks of grilled chicken (tikka) cooked in a smooth buttery & creamy tomato based gravy.",
      "image": "https://via.placeholder.com/150",
      "ingredients": [
        "500g boneless chicken (cut into bite-sized pieces)","1/2 cup plain yogurt","2 tbsp lemon juice",
"1 tsp ground cumin","1 tsp ground coriander","1 tsp garam masala","1 tsp paprika","1 tsp turmeric powder","1 tsp salt",
"2 tbsp ginger-garlic paste","2 tbsp oil (for grilling/frying)"
      ],
      "instructions": [
        "In a large bowl, combine yogurt, lemon juice, cumin, coriander, garam masala, paprika, turmeric, salt, and ginger-garlic paste.","Add the chicken pieces, toss to coat, cover, and refrigerate for at least 1 hour (or up to overnight for better flavor).",
"Preheat a grill, oven, or pan to medium-high heat. If using a grill or oven, you can skewer the marinated chicken.","Grill or cook the chicken in batches until cooked through and lightly charred, about 5-7 minutes on each side. The chicken doesn't need to be fully cooked at this point as it will cook further in the sauce. Set aside.",
"Add the grilled chicken pieces to the masala sauce, stirring to coat the chicken in the sauce.","Pour in the cream or coconut milk, and stir well. Simmer the sauce for another 10-15 minutes until the chicken is fully cooked and the flavors are well combined. Taste and adjust salt if necessary"
      ]
    }
  ]